Given a `Weather` table, write a SQL query to find all dates' Ids with higher temperature compared to its previous (yesterday's) dates.


| Id(INT) | RecordDate(DATE) | Temperature(INT) |
|---------|------------------|------------------|
|       1 |       2015-01-01 |               10 |
|       2 |       2015-01-02 |               25 |
|       3 |       2015-01-03 |               20 |
|       4 |       2015-01-04 |               30 |


For example, return the following Ids for the above Weather table:


| Id |
|----|
|  2 |
|  4 |



`Database Schema`

---
```mysql
Create table If Not Exists Weather (Id int, RecordDate date, Temperature int);
Truncate table Weather;
insert into Weather (Id, RecordDate, Temperature) values ('1', '2015-01-01', '10');
insert into Weather (Id, RecordDate, Temperature) values ('2', '2015-01-02', '25');
insert into Weather (Id, RecordDate, Temperature) values ('3', '2015-01-03', '20');
insert into Weather (Id, RecordDate, Temperature) values ('4', '2015-01-04', '30');
```

Given a `Weather` table, write a SQL query to find all dates' Ids with higher temperature compared to its previous (yesterday's) dates.

In [2]:
# Create connection:
import mysql.connector
import pandas as pd
def query(query):
        mySql_connector = mysql.connector.connect(
        host="localhost",
        user="root",
        passwd="",
        database="leedcode_test"
        )
        data= pd.read_sql_query(query , mySql_connector)
        return data

In [5]:
query("""
SELECT * FROM Weather;

""")

   Id  RecordDate  Temperature
0   1  2015-01-01           10
1   2  2015-01-02           25
2   3  2015-01-03           20
3   4  2015-01-04           30

In [8]:
query("""
SELECT
    a.id AS 'Id'
FROM
    Weather as a;

""")

   Id
0   1
1   2
2   3
3   4

`DATEDIFF`

The MySQL `DATEDIFF` function returns the difference in days between two date values.

Syntax:
    
The syntax for the DATEDIFF function in MySQL is:

DATEDIFF( date1, date2 )

Parameters or Arguments

date1 and date2

The two dates to calculate the difference between. The calculation is date1 - date2.


`Note`

Only the date portion of date1 and date2 is used in the DATEDIFF calculation. The time portion of date1 and date2 is ignored.

In [18]:
query("""
SELECT
    *
FROM
    Weather as a
        JOIN
    Weather w ON DATEDIFF(a.RecordDate, w.RecordDate)  = 1
        AND a.Temperature > w.Temperature;

""")

   Id  RecordDate  Temperature  Id  RecordDate  Temperature
0   2  2015-01-02           25   1  2015-01-01           10
1   4  2015-01-04           30   3  2015-01-03           20

In [16]:
query("""
SELECT
    a.id AS 'Id'

FROM
    Weather as a
        JOIN
    Weather w ON DATEDIFF(a.RecordDate, w.RecordDate) = 1
        AND a.Temperature > w.Temperature
;

""")

   Id
0   2
1   4